xml/ReadRQ.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" soapenv:mustUnderstand="1">
      <wsse:UsernameToken>
        <wsse:Username>Emerald</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">8Ex8Yk909c354uf2cr54EMeV</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <OTA_ReadRQ xmlns="http://www.opentravel.org/OTA/2003/05" Version="1.0" TimeStamp="time-xxx" EchoToken="echo-xxx">
      <POS>
        <Source>
          <RequestorID Type="22" ID="EMERALD" />
        </Source>
      </POS>
      <ReadRequests>
        <HotelReadRequest HotelCode="Emerald498">
          <SelectionCriteria SelectionType="Undelivered" />
        </HotelReadRequest>
      </ReadRequests>
    </OTA_ReadRQ>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
