Source/SOAP_Request_App/StrangeErrorBookit.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header>
    <Interface xmlns="http://www.bookit.com/api/Documentation/XML/OTA/4/2011A/" ChannelIdentifierId="BookIt.com XML4" Version="2011A" Interface="SourceSys XML">
      <ComponentInfo Id="05102" User="TiKoob" Pwd="TiKoob" ComponentType="Hotel"/>
    </Interface>
  </soap-env:Header>
  <soap-env:Body>
    <OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opentravel.org/OTA/2003/05 OTA_HotelResNotifRQ.xsd" Version="1.003">
      <HotelReservations>
        <HotelReservation>
          <RoomStays>
            <RoomStay>
              <RoomRates>
                <RoomRate RoomTypeCode="10905" RatePlanCode="BKPROMO1" EffectiveDate="2014-02-28" ExpireDate="2014-03-01">
                  <Rates>
                    <Rate EffectiveDate="2014-02-28" ExpireDate="2014-03-01">
                      <Base AmountBeforeTax="38.8" AmountAfterTax="44.97" CurrencyCode="USD"/>
                      <Total AmountBeforeTax="38.8" AmountAfterTax="44.97" CurrencyCode="USD"/>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts>
                <GuestCount AgeQualifyingCode="10" Count="2"/>
              </GuestCounts>
              <TimeSpan Start="2014-02-28" End="2014-03-01"/>
              <Total AmountBeforeTax="155.2" AmountAfterTax="179.88" CurrencyCode="USD"/>
              <BasicPropertyInfo HotelCode="05102"/>
              <ResGuestRPHs>
                <ResGuestRPH RPH="1"/>
              </ResGuestRPHs>
              <Comments>
                <Comment>
                  <Text>Special Requests are requested from your hotel but cannot be guaranteed as part of your reservation.</Text>
                </Comment>
              </Comments>
            </RoomStay>
            <RoomStay>
              <RoomRates>
                <RoomRate RoomTypeCode="10905" RatePlanCode="BKPROMO1" EffectiveDate="2014-02-28" ExpireDate="2014-03-01">
                  <Rates>
                    <Rate EffectiveDate="2014-02-28" ExpireDate="2014-03-01">
                      <Base AmountBeforeTax="38.8" AmountAfterTax="44.97" CurrencyCode="USD"/>
                      <Total AmountBeforeTax="38.8" AmountAfterTax="44.97" CurrencyCode="USD"/>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts>
                <GuestCount AgeQualifyingCode="10" Count="2"/>
              </GuestCounts>
              <TimeSpan Start="2014-02-28" End="2014-03-01"/>
              <Total AmountBeforeTax="155.2" AmountAfterTax="179.88" CurrencyCode="USD"/>
              <BasicPropertyInfo HotelCode="05102"/>
              <ResGuestRPHs>
                <ResGuestRPH RPH="2"/>
              </ResGuestRPHs>
              <Comments>
                <Comment>
                  <Text>Special Requests are requested from your hotel but cannot be guaranteed as part of your reservation.</Text>
                </Comment>
              </Comments>
            </RoomStay>
          </RoomStays>
          <ResGuests>
            <ResGuest ResGuestRPH="1" RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Zhiming</GivenName>
                        <Surname>Yu</Surname>
                      </PersonName>
                      <Telephone PhoneNumber="6268239081" PhoneTechType="1"/>
                      <Email>zy281666@yahoo.com</Email>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest ResGuestRPH="1" RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Kelly</GivenName>
                        <Surname>Yu</Surname>
                      </PersonName>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest ResGuestRPH="2" RPH="2">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Xiaomei</GivenName>
                        <Surname>Zhang</Surname>
                      </PersonName>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest ResGuestRPH="2" RPH="2">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Weimin</GivenName>
                        <Surname>Wu</Surname>
                      </PersonName>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
          </ResGuests>
          <ResGlobalInfo>
            <HotelReservationIDs>
              <HotelReservationID ResID_Type="14" ResID_Value="28430775" ResID_Source="BookIt.com"/>
            </HotelReservationIDs>
          </ResGlobalInfo>
        </HotelReservation>
      </HotelReservations>
    </OTA_HotelResNotifRQ>
  </soap-env:Body>
</soap-env:Envelope>
