Source/SOAP_Request_App/multiunit_booking3.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header>
    <Interface xmlns="http://www.bookit.com/api/Documentation/XML/OTA/4/2011A/" ChannelIdentifierId="BookIt.com XML4" Version="2011A" Interface="SourceSys XML">
      <ComponentInfo Id="04819" User="TiKoob" Pwd="TiKoob" ComponentType="Hotel"/>
    </Interface>
  </soap-env:Header>
  <soap-env:Body>
    <OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opentravel.org/OTA/2003/05 OTA_HotelResNotifRQ.xsd" Version="1.003">
      <HotelReservations>
        <HotelReservation>
          <RoomStays>
            <RoomStay>
              <RoomRates>
                <RoomRate RoomTypeCode="9622" RatePlanCode="BKPROMO2" EffectiveDate="2013-10-18" ExpireDate="2013-10-25">
                  <Rates>
                    <Rate EffectiveDate="2013-10-15" ExpireDate="2013-10-17">
                      <Total AmountBeforeTax="334.4" AmountAfterTax="374.53" CurrencyCode="USD"/>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts>
                <GuestCount AgeQualifyingCode="10" Count="2"/>
              </GuestCounts>
              <TimeSpan Start="2013-11-15" End="2013-11-17"/>
              <Total AmountBeforeTax="334.4" AmountAfterTax="374.53" CurrencyCode="USD"/>
              <ResGuestRPHs>
                <ResGuestRPH RPH="1"/>
              </ResGuestRPHs>
              <Guarantee>
                <GuaranteesAccepted>
                  <GuaranteeAccepted>
                    <PaymentCard CardCode="MC" CardNumber="5529420324181479" ExpireDate="0716" SeriesCode="641">
                      <CardHolderName>Jennifer Garcia</CardHolderName>
                    </PaymentCard>
                  </GuaranteeAccepted>
                </GuaranteesAccepted>
              </Guarantee>
              <BasicPropertyInfo ChainCode="" HotelCode="04819"/>
              <Comments>
                <Comment>
                  <Text>test</Text>
                </Comment>
              </Comments>
            </RoomStay>
          </RoomStays>
          <ResGuests>
            <ResGuest RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Jennifer</GivenName>
                        <Surname>Garcia</Surname>
                      </PersonName>
                      <Telephone PhoneNumber="8502348887" PhoneTechType="Voice"/>
                      <Email>jennifer.garcia@bookit.com</Email>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Arthur</GivenName>
                        <Surname>Finlaw</Surname>
                      </PersonName>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
          </ResGuests>
          <ResGlobalInfo>
            <HotelReservationIDs>
              <HotelReservationID ResID_Type="14" ResID_Value="25526305" ResID_Source="BookIt.com"/>
            </HotelReservationIDs>
          </ResGlobalInfo>
        </HotelReservation>
      </HotelReservations>
    </OTA_HotelResNotifRQ>
  </soap-env:Body>
</soap-env:Envelope>
 